Revit 2027 API
LinkOperations.SetOnLocalLinkSharedCoordinatesSavedCallback Method
 Sets the callback that will be called when the Revit user saves new shared coordinate settings to a linked document obtained from an IExternalResourceServer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetOnLocalLinkSharedCoordinatesSavedCallback(
	IOnLocalLinkSharedCoordinatesSavedCallback onLocalLinkSharedCoordinatesSaved
)
Public Sub SetOnLocalLinkSharedCoordinatesSavedCallback (
	onLocalLinkSharedCoordinatesSaved As IOnLocalLinkSharedCoordinatesSavedCallback
)
public:
void SetOnLocalLinkSharedCoordinatesSavedCallback(
	IOnLocalLinkSharedCoordinatesSavedCallback^ onLocalLinkSharedCoordinatesSaved
)
member SetOnLocalLinkSharedCoordinatesSavedCallback :
        onLocalLinkSharedCoordinatesSaved : IOnLocalLinkSharedCoordinatesSavedCallback -> unit
Parameters
onLocalLinkSharedCoordinatesSaved IOnLocalLinkSharedCoordinatesSavedCallback
 An IOnLocalLinkSharedCoordinatesSavedCallback object that can respond when the user saves new shared coordinates to a Revit link document obtained from IExternalResourceServer.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LinkOperations Class
Autodesk.Revit.DB Namespace